//Active Directory password has expired
SigninLogs
| where UserPrincipalName contains "XXXXXX"
| where TimeGenerated > ago(30d)
| where ResultDescription == "User's Active Directory password has expired. Generate a new password for the user or have the end user using self-service reset tool."
| project TimeGenerated, UserPrincipalName, ResultDescription




// troca de senha do usuário
AuditLogs
| where OperationName in ("Change user password", "Reset user password")
| extend User = tostring(TargetResources[0].userPrincipalName)
| where User contains "Xxxxxxx"
| project TimeGenerated, OperationName, User, InitiatedBy, Result


//
SecurityEvent
| where EventID in (4723, 4724, 628)
| where TargetUserName contains "joao"
| project TimeGenerated, EventID, Account = SubjectUserName, TargetAccount = TargetUserName, Computer


* **4723:** Tentativa de **alteração de senha** por quem já conhece a senha atual (ex.: o próprio usuário ou administrador).
* **4724:** Tentativa de **resetar/redefinir a senha** de outro usuário, sem precisar da senha atual (geralmente feito por administrador).
* **628:** Evento legado do Windows Server antigo (pré-2008), também indica **alteração de senha**.
