//Active Directory password has expired
SigninLogs
| where UserPrincipalName contains "silva.jose_adm"
| where TimeGenerated > ago(30d)
| where ResultDescription == "User's Active Directory password has expired. Generate a new password for the user or have the end user using self-service reset tool."
| project TimeGenerated, UserPrincipalName, ResultDescription
