//monitorar um aplicativo integrado no Azure

AuditLogs
| where Category == "ApplicationManagement"
| extend TargetResourceName = tostring(TargetResources[0].displayName), TargetResourceType = tostring(TargetResources[0].resourceType)
| project TimeGenerated, OperationName, InitiatedBy, TargetResources

****************************
//buscando pelo aplicativo pernonalizado
AuditLogs
| where Category == "ApplicationManagement"
| mv-expand TargetResources  // Expande a matriz TargetResources em linhas
| extend TargetResourceName = tostring(TargetResources.displayName)
| where TargetResourceName == "FoxitPDFOneDrive"
| project TimeGenerated, OperationName, ResultDescription, InitiatedBy, TargetResourceName

*************************************

AuditLogs
| where Category == "ApplicationManagement"
| project TimeGenerated, OperationName, ResultDescription, InitiatedBy, TargetResources
| mv-expand TargetResources  // Expande a matriz TargetResources em linhas
| project TimeGenerated, OperationName, ResultDescription, InitiatedBy, 
          TargetResourceName = tostring(TargetResources.displayName), 
          TargetResourceType = tostring(TargetResources.resourceType)
