### Criação de regras no Sentinel

1 ########################################
AzureActivity
| where OperationNameValue == "MICROSOFT.SECURITYINSIGHTS/ALERTRULES/WRITE"
| where ActivityStatusValue == "Success"
| where ActivitySubstatusValue == "Created"
| extend RuleName = tostring(split(ResourceId, "/")[-1])
| project
    TimeGenerated,
    Caller,
    RuleName,
    ResourceGroup,
    SubscriptionId
| order by TimeGenerated desc


2 ########################################
AzureActivity
| where OperationNameValue =~ "MICROSOFT.SECURITYINSIGHTS/ALERTRULES/WRITE"
| extend RuleName = tostring(split(ResourceId, "/")[-1])
| project TimeGenerated, Caller, RuleName, ActivityStatusValue, ActivitySubstatusValue
| order by TimeGenerated desc

